# -*- coding: utf-8 -*-
#作为函数调用接口API

from fund_position_func import Algo_fund_position

Algo_fund_position(result_dir='./results/OLS+PCA').main(model_type = 'OLS+PCA',
                                                datelist = ['20210331','20210630', '20210930', '20211231', '20220331'],
                                                fundlist = ['景顺长城策略精选','万家汽车新趋势A','万家成长优选A','华安动态灵活配置A','万家臻选','中金新锐A',
                                                            '北信瑞丰健康生活主题','华宝资源优选A','华商新锐产业','国投瑞银策略精选','华宝国策导向',
                                                             '万家新兴蓝筹','建信中国制造2025A','建信健康民生A','信达澳银核心科技','前海开源股息率100强','华宝收益增长',
                                                            '中泰玉衡价值优选','景顺长城成长之星','国泰鑫睿','工银瑞信新机遇A','海富通改革驱动',
                                                            '华泰柏瑞量化先行A','建信弘利','国泰聚优价值A','华夏新锦绣A','南方中国梦',
                                                            '融通内需驱动AB','浦银安盛新经济结构A','建信改革红利','诺安安鑫','中信保诚精萃成长',
                                                            '信达澳银精华A','华宝宝康灵活','大成灵活配置','东吴新趋势价值线','平安新鑫先锋A','海富通收益增长',
                                                            '中银主题策略A','广发睿毅领先A','中泰星元价值优选A','东方主题精选','鹏华价值精选',
                                                            '金鹰中小盘精选','华商科技创新'], each_len = 24, PCA_n = 9, lamda = 0.001)
